This dataset can be found on kaggle: https://www.kaggle.com/kaggle/sf-salaries
#### https://www.youtube.com/watch?v=Ed0P_CVjJcM

### Import pandas as pd

In [1]:
import pandas as pd
import numpy as np

### Read salaries as a dataframe

In [2]:
df = pd.read_csv('C:\\Users\\Admin\\Desktop\\Courses&Certifications\\Python\\Kaggle\\Salaries.csv', low_memory=False)
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### Check the head of the Dataframe

In [4]:
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

### Use the .info() method to find out how many entries there are

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [6]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

### What is the Average Basepay

In [76]:
df["BasePay"].unique()

array([167411.18, 155966.02, 212739.13, ..., '6.04', '15.50',
       'Not Provided'], dtype=object)

In [22]:
df['BasePay']

0               167411
1               155966
2               212739
3                77916
4               134402
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [77]:
df[df['BasePay'].str.contains('[a-zA-Z]') == True]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN

In [79]:
df["BasePay"].isna().sum()

605

In [7]:
for column in ['BasePay', 'Benefits']:
    df[column] = np.where((df[column].isna()) | (df[column] == "Not Provided"),0,df[column])

In [9]:
df['BasePay'] = df['BasePay'].astype(float)

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148654 non-null float64
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            148654 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(4), int64(2), object(7)
memory usage: 14.7+ MB

In [10]:
for column in ['OvertimePay', 'OtherPay']:
    df[column] = np.where((df[column].isna()) | (df[column] == "Not Provided"),0,df[column])

In [11]:
df[['OvertimePay','OtherPay']] = df[['OvertimePay','OtherPay']].astype(float)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148650 entries, 0 to 148650
Data columns (total 13 columns):
Id                  148650 non-null int64
EmployeeName        148650 non-null object
JobTitle            148650 non-null object
BasePay             148650 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            148650 non-null float64
TotalPay            148650 non-null float64
TotalPayBenefits    148650 non-null float64
Year                148650 non-null int64
Notes               0 non-null float64
Agency              148650 non-null object
Status              38117 non-null object
dtypes: float64(7), int64(2), object(4)
memory usage: 15.9+ MB

In [12]:
for column in ['Status']:
    df[column] = np.where((df[column].isna()) | (df[column] == "Not Provided"),0,df[column])

In [13]:
df["Status"] = df["Status"].fillna("Missing Value")

In [56]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148650.00000,148650.000000,148650.000000,148650.000000,148650.000000,148650.000000,148650.000000,148650.000000,0.0
mean,74325.50002,66055.506718,5066.059886,3648.771455,18924.742068,74770.338059,93695.080127,2012.522603,NaN
std,42911.70313,42885.919334,11454.380559,8056.599823,17165.229731,50516.189828,62792.491166,1.117526,NaN
min,1.00000,-166.010000,-0.010000,-7058.590000,-33.890000,0.000000,-33.890000,2011.000000,NaN
25%,37163.25000,32798.550000,0.000000,0.000000,0.000000,36169.955000,44073.337500,2012.000000,NaN
50%,74325.50000,64862.310000,0.000000,811.270000,23217.135000,71427.240000,92406.020000,2013.000000,NaN
75%,111487.75000,94609.715000,4658.175000,4236.065000,33468.980000,105842.960000,132877.992500,2014.000000,NaN
max,148651.00000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

In [55]:
df['BasePay'].mean()

66055.50671774488

### The highest amount of OvertimePay in the Dataset

In [60]:
df['OvertimePay'].max()

245131.88

### What is Job tiltle of JOSEPH DRISCOLL?

In [61]:
df['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148645     Carolyn A Wilson
148646         Not provided
148648          Leon Walker
148649        Roy I Tillery
148650         Not provided
Name: EmployeeName, Length: 148650, dtype: object

In [62]:
# Indexing - df[df] actually df2 --> call dataframe 
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,0.0,270324.91,270324.91,2011,NaN,San Francisco,0

In [63]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

### How much does JOSEPH DRISCOLL makes (including Benefits)?

In [64]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

### What is the name of highest person (including Benefits)?

In [65]:
df['TotalPayBenefits'].max()

567595.43

In [66]:
df['TotalPayBenefits'] == df['TotalPayBenefits'].max()

0          True
1         False
2         False
3         False
4         False
          ...
148645    False
148646    False
148648    False
148649    False
148650    False
Name: TotalPayBenefits, Length: 148650, dtype: bool

In [67]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,0.0,567595.43,567595.43,2011,NaN,San Francisco,0

In [68]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [14]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

### What was the average Basepay of all employees per year (2011-2014)

In [16]:
df.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    68509.832156
2014    66557.437750
Name: BasePay, dtype: float64

### How many unique job title out there?

In [17]:
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [18]:
df['JobTitle'].nunique()

2159

### What are the top 5 common Jobs?

In [44]:
df['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [21]:
df['JobTitle'].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

### How many job titles were represented by only one person in 2013? Only one time appeared

In [27]:
(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1).sum()

202

### How many people have the world Manager in thier Job title? (This is pretty tricky)

In [46]:
# all records in job title are string
def manager(string):
    if 'manager' in (string.lower()):
        return True
    else:
        return False

In [47]:
manager('GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY')

True

In [48]:
manager('cheif METROPOLITAN TRANSIT AUTHORITY')

False

In [49]:
manager('CHEIF MANAGER-METROPOLITAN TRANSIT AUTHORITY')

True

In [50]:
# use apply to call other function. X is JobTitle
df['JobTitle'].apply(lambda x: manager(x))

0          True
1         False
2         False
3         False
4         False
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [51]:
df['JobTitle'].apply(lambda x: manager(x)).sum()

4110

### Bonus: is there any correlation between the lenght of the job title and salary?

In [52]:
# new variable called numebr of title (ntitle)
# apply(len) the function apply on each record in the column
df['ntitles'] = df['JobTitle'].apply(len)
df['ntitles']

0         46
1         31
2         31
3         36
4         44
          ..
148649     9
148650    12
148651    12
148652    12
148653    26
Name: ntitles, Length: 148654, dtype: int64

In [54]:
# df[] its series 
# df[['']] its frame
df[['ntitles', 'TotalPayBenefits']].corr()

                   ntitles  TotalPayBenefits
ntitles           1.000000         -0.036878
TotalPayBenefits -0.036878          1.000000

### =========
### Thank You